Enhance project and readme file...
